<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of LocalStack CLI.

Valid options for ARCH input variable are "arm64" for Apple Silicon (default) or "amd64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.flywire.download.LocalStackCLI</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>LocalStackCLI</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>localstack-cli-[\d\.]+-darwin-%ARCH%-onefile\.tar\.gz</string>
				<key>github_repo</key>
				<string>localstack/localstack-cli</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
