<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VooV Meeting.</string>
	<key>Identifier</key>
	<string>com.github.flywire.download.VooVMeeting</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VooV Meeting</string>
		<key>ARCH</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>VooVMeetingInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>md5checksum</key>
				<string>%md5%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/MD5Checksum</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VooV Meeting.app</string>
				<key>requirement</key>
				<string>identifier "com.tencent.tencentmeeting" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "88L2Q4487U"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
