<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VooV Meeting and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peertransfer.munki.VooVMeeting</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VooV Meeting</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Tencent</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Backed by Tencent's years of experience in audiovisual communications, VooV Meeting provides one-stop cloud-based conferencing solutions. The high-definition and smooth audiovisual quality allows you to experience immersive conference collaboration anytime, anywhere.</string>
			<key>developer</key>
			<string>Tencent</string>
			<key>display_name</key>
			<string>VooV Meeting</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peertransfer.download.VooVMeeting</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
