<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of cloudflared and imports it into Munki.

ARCH_TYPE=("arm64", "amd64")
SUPPORTED_ARCH=("arm64", "x86_64")</string>
	<key>Identifier</key>
	<string>com.github.flywire.munki.cloudflared</string>
	<key>Input</key>
	<dict>
		<key>ARCH_TYPE</key>
		<string>arm64</string>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/utilities</string>
		<key>NAME</key>
		<string>cloudflared</string>
		<key>SUPPORTED_ARCH</key>
		<string>arm64</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Contains the command-line client and its libraries for Argo Tunnel, a tunneling daemon that proxies any local webserver through the Cloudflare network.</string>
			<key>developer</key>
			<string>Cloudflare</string>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>display_name</key>
			<string>Cloudflared for Argo Tunnel</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>%SUPPORTED_ARCH%</string>
			</array>
			<key>unattended_install</key>
			<true/>
            <key>icon_name</key>
	        <string>generic.png</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.flywire.download.cloudflared</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
