<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of cloudflared binary and creates a pkg.</string>
	<key>Identifier</key>
	<string>com.github.peertransfer.pkg.cloudflared</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>cloudflared</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.peertransfer.download.cloudflared</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkg</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin</string>
                <key>purge_destination</key>
                <true/>
                <key>archive_format</key>
                <string>tar_gzip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>com.cloudflare.cloudflared</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr/local/bin</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
